package com.github.thorqin.reader

import org.junit.Test
import java.util.regex.Pattern

class AppTest {

	@Test
	fun testRegex() {
		val reg = Regex("\\s+")
		println(reg.matches("  \n  "))
		println(App.TOPIC_RULE.replace(reg, ""))
	}

	@Test
	fun testLoop() {
		for (i in 0..5) {
			println(i)
		}

		for (i in (0..5).reversed()) {
			println(i)
		}
	}

	@Test
	fun testRegex2() {
		val sentenceToken = Pattern.compile("[.;\"：；“。\\n]", Pattern.MULTILINE)
		val m = sentenceToken.matcher("个大陆超过三十亿人对这个风之凌恨之入骨……”\n" +
			"“三十亿……人”叶笑打了个冷颤。\n" +
			"妈的,老子在开始拍卖的时候,怎么没想到这一点？居然有这么老些人骂我？\n" +
			"天哪\n" +
			"“现在,各大帝国多方势力,都开出悬赏,悬赏风之凌的人头,不过这也是人之常情,那风之凌落到这个危局之中,只能归结于四字,咎由自取。”左无忌轻轻地叹了口气。\n" +
			"“啥？我说左左,你这么说一个帝国英雄是不是有点太过了,怎么各国悬赏风之凌人头反倒成了人之常情,风之凌反而是咎由自取,你这未免太……过分了吧”叶笑颇为不服气的说道。\n" +
			"“笑笑,怎地你对那风之凌好似特别有好感呢？怎么总是帮他说话呢”左无忌似是发现了什么好玩的事情\n" +
			"他的眼睛看着叶笑,嘴角似笑非笑,但,眼神深处,却是一片思索。\n" +
			"“我也不是专门为他辩驳,就是觉得一个为帝国付出这么多的人,无论如何,他为帝国着想出力的本心初衷总是没错的,你不该那么诋毁他把”叶笑沉声道。\n" +
			"“我刚才对他的评价真不是诋毁他,已经很客观了”左无忌道。\n" +
			"“我去,你还想怎么埋汰他,你那还不算诋毁,还要怎么才算诋毁,风之凌怎么也都是咱们辰皇本土之人,你至于那么说他么？”叶笑显然是有些不高兴了\n" +
			"“笑笑,咱们当下做的乃是信息分析整理,乃至运用,做这方面的工作,看事立场一定要中立,不能有个人情绪,我既然对风之凌有以上评价,就有我的道理,反而是你,很有些感情用事啊,难道你和那个风之凌很熟悉么？”左无忌道。\n" +
			"“嗯？我俩,不熟悉啊……不是很熟悉了……”叶笑被左无忌突如其来的一问,问得有点前言不搭后语\n" +
			"“算了,你俩有没有渊源都好,反正他现在失踪了,就算有心,你也不能马上将他带到我面前了……我还是从头给你分析一下,灵宝阁的处境,你就能理解,我为什么对风之凌有那等评价了”\n" +
			"“好,我洗耳恭听”\n" +
			"“那灵宝阁的分部遍布整个寒阳大陆,素来以超然于各国各方势力的立场而著称,亦因此而游离与各国的高层权力圈之外,已历数千年岁月而不倒,除了他所拥有的财力极端庞大之外,他不会对任何单一帝国有偏向援助,亦是他能绵延至今的一大重要因素\n" +
			"可是灵宝阁君座风之凌这次贸贸然地打破惯例,正式表态支持辰皇帝国,这样的做法,其实是极端犯众怒的做法,虽然就短期而言,获利空前,可是对于灵宝阁本身而言,基本已经没有未来可言,我可断言,若灵宝阁之后没有强力援手支持,这个屹立寒阳数千年的超级拍卖场所,将在短期之内,绝迹于人间”左无忌森然道。\n" +
			"“不至于那么严重吧？我看那风之凌还是挺有手腕的,灵宝阁也不至于那么脆弱,再退一万步说,就算在其他国家的灵宝阁不能再开,总能在辰皇帝国继续吧,难道辰皇帝国也会对灵宝阁不利？”叶笑道：“那岂不就成了全然的忘恩负义？”。\n" +
			"...\n" +
			"\n" +
			"\n" +
			"第三百四十章 不懂政治【第四更！】\n" +
			"79_79231左无忌一声叹息：“笑笑,你太不了解国家政治了,在灵宝阁为帝国付出的时候,帝国自然很感谢很感激灵宝阁,可是当灵宝阁不能再给帝国带来足够利益,甚至沦为负累的时候,帝国便会毫不犹豫的将之舍弃,至于风之凌手腕如何见仁见智,我还可再断言另外一件事,那就是风之凌这个君座,必然是近期之内,才入主灵宝阁的,以灵宝阁大老板万正豪数千年的阅历论,若仍是由他做主,他绝不会于出这么脑残的事情”左无忌道。\n" +
			"叶笑张了半天嘴,却没有说出任何话,因为左无忌说的都是真话,实话,自己无从辩驳\n" +
			"“好了,还是继续论说当前形势,各国官方派出来的杀手,数目众多,难以详细归类同级,但总算还是有一点点脉络可循,总体来说,据不完全统计,各国目前挂了号的杀手,进入辰星城里面的,大抵有不下五千之数而这些人,在进入城中之后,就全部都消失了……”\n" +
			"“换言之,隐藏在暗处的杀手,还不知道有多少,但至少不会少于五千人。”\n" +
			"“而且,这个至少还只是官面的。”左无忌道：“更可怕的,还是江湖的杀手组织,还有那些自由杀手……”左无忌说道：“这些人,可是完全没有身份背景来历可言的,不过,有一点还是可以肯定地,那就是最近这几天,四个城门的人口出入流量,超出了之前的平均数;两倍”\n" +
			"“先不要表示惊讶,真正该惊讶的还在后边,我刚才说的超过平均数的两倍,只限于入城之人,而这几天出城的人数,竟是与往常无异的;这也就是说,这几天下来,最少有十万人,进来了就没有再出去。这些人是于什么的？目标是什么？可想而知。”\n" +
			"“这里面,有很多的人的目标,自然是灵宝阁,风之凌,万正豪。当然,还不至于所有人的目标都锁定到灵宝阁中人的身上,毕竟这里是辰皇国都,相信还是会有很多人,会把目标锁定于皇宫,乃至于这整座辰星城”\n" +
			"“嗯,你说的这些我都听明白了,确实有道理,不过,对于这些人,你真的一点办法都没有么？或者说,需要以什么为前提,你才能予以应对呢？”叶笑问道\n" +
			"“所谓有法有破,想要应对这些人,肯定是有方向可循,但,这需要相当的实力未基础,巧妇难为无米之炊,没有足够的实力予以应对,一切只是空谈”左无忌道。\n" +
			"“比如呢,我是说,如果有人能够给你提供一定的战力,你有什么手段应付当前乱局？”叶笑追问道。\n" +
			"“这个好说,对方要什么,我们就给")

	}
}
